'''
Введіть з клавіатури в масив п'ять цілочисельних значень. Виведіть їх в
один рядок через кому. Отримайте для масиву середнє арифметичне.
Постолович А.С. 122-В
'''
import numpy as np

A = np.zeros(5) #створюємо пустий масив розмірністю 5
for i in range(5):
    A[i] = int(input('input: ')) #заповнюємо його числами

for i in range(len(A)):
    print(A[i], end=', ') #виводимо числа в рядок через кому
m = sum(A) / len(A)
print(f'\nСереднє арифметичне - {m}') #знахлдимо і виводимо середнє артфметичне