'''
Дані про температуру води на Чорноморському узбережжі за декаду
вересня зберігаються в масиві. Визначити, скільки за цей час було днів, придатних для
купання.
Постолович А. С. 122-В
'''
import numpy as np
import random

A = np.zeros(10) #створюємо пустий масив
k = 0 #створюємо лічильник
for i in range(10):
    A[i] = random.randint(-5,30) #заповнюємо масив значенями
for j in range(10):
    if A[j] > 20:
        k += 1 #підраховуємо скільки разів температура була придатною для купання
print(f'Придатних днів для купання - {k}')