'''
Знайти суму елементів масиву дійсних чисел, що мають непарні номери.
Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами від 100
до 200.
Постолович А.С. 122-В
'''
import numpy as np
import random
A = np.zeros(20) #створюємо пустий масив
z = [] #створюємо пустий список
for i in range(20):
    A[i] = random.randint(100, 200) #заповнюємо масив значенями
    if i%2 != 0:
        z.append(A[i]) #додаємо в список всі числа номери яких непарні
z_sum = sum(z)
print(f'Сума всіх чисел з непарними номерами - {z_sum}') #знаходимо і виводимо суму всіх чисел вс списку