'''
Знайти добуток всіх елементів масиву цілих чисел, менших 0. Розмірність
масиву - 10. Заповнення масиву здійснити за допомогою клавіатури.
Постолович А.С. 122-В
'''
from functools import reduce
import numpy as np

A = np.zeros(10) #створюємо пустий масив
z = [] #створюємо пустий список
for i in range(10):
    A[i] = int(input('Введіть значення:')) #заповнюємо масив значенями
    if A[i] < 0:
        z.append(A[i]) #
z_mult = reduce(lambda x, y: x*y, z) #знаходимо добуток всіх чисел у списку
print(f"Добуток всіх від'ємних чисел - {z_mult}") #виводимо добуток всіх чисел у списку
