'''
Знайти суму всіх елементів масиву цілих чисел що задовольняють умові:
остача від ділення на 2 дорівнює 3. Розмірність масиву - 20. Заповнення масиву
здійснити випадковими числами від 200 до 300.
Постолович А.С. 122-В
'''
from functools import reduce
import numpy as np
import random

A = np.zeros(20) #створюємо пустий масив
z = [] #створюємо пустий список
for i in range(20):
    A[i] = random.randint(200,300) #заповнюємо масив значенями
print('Не існує чисел у яких остача від ділення на 2 дорівнює 3')