'''
Знайти суму всіх елементів масиву дійсних чисел, більших за задане
число. Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами
від 50 до 100.
Постолович А. С. 122-В
'''
import numpy as np
import random

A = np.zeros(20) #створюємо пустий масив
a = int(input('Введіть число: '))
z = [] #створюємо пустий список
for i in range(20):
    A[i] = random.randint(50,100) #заповнюємо масив значеннями
    if A[i] > a:
        z.append(A[i]) #додаємо в список всі числа більші за вказане
if len(z) != 0:
    z_sum = sum(z) #знаходимо і виводимо всі суму чисел більших за вказане
    print(f'Сума всіх чисел більших за {a} дорівнює {z_sum}')
else:
    print(f'Немає чисел більших за {a}')