'''
Знайти добуток всіх елементів масиву дійсних чисел, менших заданого
числа. Розмірність масиву - 10. Заповнення масиву здійснити випадковими числами
від 50 до 100.
Постолович А. С. 122-В
'''
from functools import reduce
import numpy as np
import random

A = np.zeros(10) #створюємо пустий масив
a = int(input('Введіть число: '))
z = [] #створюємо пустий список
for i in range(10):
    A[i] = random.randint(50,100) #заповнюємо масив значеннями
    if A[i] < a:
        z.append(A[i]) #додаємо в список всі числа більші за вказане
if len(z) != 0:
    z_mult = reduce(lambda x, y: x * y, z)  # знаходимо і виводимо добуток всіх чисел менших за вказане
    print(f"Добуток всіх чисел менших за {a} - {z_mult}")
else:
    print(f'Немає чисел менших за {a}')