'''
Знайти суму всіх елементів масиву цілих чисел, які менше середнього
арифметичного елементів масиву. Розмірність масиву - 20. Заповнення масиву
здійснити випадковими числами від 150 до 300.
Постолович А. С. 122-В
'''
import numpy as np
import random
A = np.zeros(20) #створюємо пустий масив
z = [] #створюємо пустий список
for i in range(20):
    A[i] = random.randint(150, 300) #заповнюємо масив значеннями
mid = sum(A)/len(A)
for j in range(20):
    if A[i] < mid:
        z.append(A[i]) #додаємо в список всі числа менші за середнє арифметичне
z_sum = sum(z) #знаходимо і виводимо всі суму чисел менших за середнє арифметичне
print(f'Сума всіх чисел менших середнє арифметичне дорівнює {z_sum}')