'''
Знайти суму елементів масиву цілих чисел, які діляться на 5 і на 8
одночасно. Розмірність масиву - 30. Заповнення масиву здійснити випадковими
числами від 500 до 1000.
Постолович А. С. 122-В
'''
import numpy as np
import random

A = np.zeros(30) #створюємо пустий масив
z = [] #створюємо пустий список
for i in range(30):
    A[i] = random.randint(500,1000) #заповнюємо масив значеннями
    if A[i]%5 == 0 and A[i]%8 == 0:
        z.append(A[i]) #додаємо в список всі числа кратні 5 і 8
if len(z) != 0:
    z_sum = sum(z)  # знаходимо і виводимо сума всіх чисел кратних 5 і 8
    print(f"Сума всіх чисел кратних 5 і 8 - {z_sum}")
else:
    print('Немає чисел кратних 5 і 8')