'''
Змінній t привласнити значення істина, якщо в одновимірному масиві є
хоча б одне від’ємне і парне число.
Постолович А.С. 122-В
'''
import numpy as np
import random

A = np.zeros(20) #створюємо пустий масив
z = [] #створюємо пустий список
t = False #вводимо змінну t
for i in range(20):
    A[i] = random.randint(-50,50) #заповнюємо масив
for i in range(20):
    for j in range(20):
        if A[i] < 0 and A[j]%2 == 0: #первіряємо чи є в масиві від'ємне число та парне число
            t = True
print(t)
print(A)