'''
Знайти суму додатніх елементів лінійного масиву цілих чисел.
Розмірність масиву - 10. Заповнення масиву здійснити з клавіатури.
Постолович А.С. 122-В
'''
import numpy as np

A = np.zeros(10) #створюємо пустий масив
z = [] #створюємо пустий список
for i in range(10):
    A[i] = int(input('Введіть число: ')) #заповнюємо масив
    if A[i] > 0:
        z.append(A[i]) #додаєм додатні елементи в список
if len(z) != 0:
    z_sum = sum(z) #якщо дотані елементи є - знаходимо і виводимо їх суму
    print(f'Сума всіх додатніх чисел - {z_sum}')
else:
    print('В масиві немає додатніх чисел') #якщо додатніх елементів немає - виводимо повідомлення про це