'''
Створіть масив з п'яти прізвищ і виведіть на екран ті з них, які
починаються з певної букви, яка вводиться з клавіатури.
Постолович А. С. 122-В
'''
import numpy as np
A = ['Вашингтон', 'Адамс', 'Джеферсон', 'Медісон', 'Монро'] #ствроємо список з прізвищами
A = np.array(A) #перетворюємо список в масив
a = input()
z = [] #створюємо пусий список
for i in range(len(A)):
    A_list = list(A[i]) #розбиваєм кожен елемент масиву на окремий список
    if A_list[0] == a: #перевіряємо чи співпадають букви
        z.append(A[i]) # якщо букви співпадають - додаємо прізвище в список
if len(z) == 0:
    print('Прізвищ не знайдено')
else:
    for i in range(len(z)): #виводимо список, якщо він пустий - виводимо провідомлення про це
        print(z[i])