'''
Створіть масив А [1..8] за допомогою генератора випадкових чисел з
елементами від -10 до 10 і виведіть його на екран. Підрахуйте кількість від’ємних
елементів масиву.
Постолович А. С. 122-В
'''
import numpy as np
import random

A = np.zeros(8) #створюємо пустий масив
k = 0 #створюємо лічтльник від'ємних чисел
for i in range(8):
    A[i] = random.randint(-10,10) # заповнюємо його випадковими числами
for j in range(len(A)):
    if A[j] < 0:
        k +=1 #перераховуємо всі елементи масиву і рахуємо від'ємні
    print(A[j], end=', ')  # поелементно виводимо масив
print(f"\nКількість від'ємних чисел - {k}") #виводимо лічильник