'''
З 8 до 20 години температура повітря вимірювалася щогодини. Відомо,
що протягом цього часу температура знижувалася. Визначте, о котрій годині було
вперше зафіксовано від'ємну температуру.
Постолович А.С. 122-В
'''
import numpy as np
import random


h = 8 #вводимо зміну, яка буде відповідати за години
t = random.randint(-20, 30) #і зміну температури
print(t) #виводимо початкову температуру
while h < 21 or t >= 0: #віднімаємо 1 градус кожну годину
    t -= 1
    h += 1
    if h > 20:
        print(f"Від'ємної температури не зафіксовано")
        break #якщо до 20 години не зафіксовано від'ємної температури - виводмо повідомлення про це
    elif t < 0:
        print(f"Від'ємну температуру зафіксовано о {h} годині")
        break #виводимо годину о котрій було зафіксовано від'ємну температуру